[
	{
		"text": "Getting my favorite tea",
		"dateCreated": "2024-12-15T15:24:00-08:00"
	},
	{
		"text": "Drink secured! Grass jelly tea. It's not too sweet and is considered a cool, refreshing drink in Chinese culture. My recent go to.",
		"dateCreated": "2024-12-15T15:40:00-08:00"
	},
	{
		"text": "The air here smells earthy, like the smell of mulch. Also a little sweet.",
		"dateCreated": "2024-12-15T16:03:00-08:00"
	},
	{
		"text": "The quiet always takes me by surprise whenever I leave the city. It's feels as if time has stopped",
		"dateCreated": "2024-12-15T16:05:00-08:00"
	},
	{
		"text": "Was chilly after getting out of the car but walking is starting to help",
		"dateCreated": "2024-12-15T16:07:00-08:00"
	},
	{
		"text": "Sees tall hill, must climb tall hill",
		"dateCreated": "2024-12-15T16:08:00-08:00"
	},
	{
		"text": "The recent wind effected this area quite a lot, the plants look battered and damaged",
		"dateCreated": "2024-12-15T16:15:00-08:00"
	},
	{
		"text": "I remember coming out here with W and A once. We had a little bubble blower thing that we used to make bubbles in the wind.",
		"dateCreated": "2024-12-15T16:20:00-08:00"
	},
	{
		"text": "The trail is a bit muddy today, watching my step",
		"dateCreated": "2024-12-15T16:28:00-08:00"
	},
	{
		"text": "Also remember coming here with J. It's been a few years since I've heard from her. It was probably for the best to let some distance grow between us. Hope she is well.",
		"dateCreated": "2024-12-15T16:33:00-08:00"
	},
	{
		"text": "I remember I brought my dog, Kona, that time. We had a picnic on the hill. Kona loved it, she took a bite out of my sandwich when I wasn't looking.",
		"dateCreated": "2024-12-15T16:35:00-08:00"
	},
	{
		"text": "She's getting older now, thinking it'd be nice to take her here again sometime",
		"dateCreated": "2024-12-15T16:35:00-08:00"
	},
	{
		"text": "I wish there was a way for people to leave little memories and personal stories at a place for other people to discover.",
		"dateCreated": "2024-12-15T16:57:00-08:00"
	},
	{
		"text": "Could just be a QR code that people scan to read and leave stories. Though anytime you're making an app like that, moderation can become necessary unfortunately. Will think about this some more…",
		"dateCreated": "2024-12-15T16:58:00-08:00"
	},
	{
		"text": "Made it to the center",
		"dateCreated": "2024-12-15T17:06:00-08:00"
	},
	{
		"text": "I like looking at the glowing lights of houses nestled in the grooves of a mountain. I think one day, I'll find my own mountain like that.",
		"dateCreated": "2024-12-15T17:16:00-08:00"
	},
	{
		"text": "Cold hands. Cold face. Picking up the pace.",
		"dateCreated": "2024-12-15T17:26:00-08:00"
	},
	{
		"text": "Felt like Dr. Suess after that last one",
		"dateCreated": "2024-12-15T17:28:00-08:00"
	},
	{
		"text": "Doing some sleuthing",
		"dateCreated": "2024-12-15T17:45:00-08:00"
	},
	{
		"text": "People take Christmas pretty seriously up here",
		"dateCreated": "2024-12-15T17:55:00-08:00"
	},
	{
		"text": "Overall, nice community and area. Passed by all the schools and seems like a tight knit place to raise a kid. Reminds me a bit of my own neighborhood growing up. House-wise, I think I'd like something that wasn't on such a grid-like street. One that has more space to expand and grow with changing interests and needs. That could have a studio I could walk to across the way like the Eames house.",
		"dateCreated": "2024-12-15T17:58:00-08:00"
	},
	{
		"text": "For a challenge, I'm gonna try to drive home without maps",
		"dateCreated": "2024-12-15T17:58:00-08:00"
	},
	{
		"text": "Having nettle leaf tea",
		"dateCreated": "2024-12-15T18:53:00-08:00"
	}
]
